aa 4
abandon 4
abate 5
accept 4
accepts 5
access 15
accommodative 4
accord 10
account 5
accounts 4
acquisition 4
acreage 5
across 19
act 13
action 37
activity 48
add 63
adding 5
additional 4
address 7
adds 49
administration 22
adnoc 5
adp 68
advance 85
advances 28
advancing 6
adviser 9
affect 6
affirms 5
africa 11
african 7
africas 6
aftermath 9
afternoon 10
agencies 4
agency 15
agenda 4
aggressive 6
agree 37
agreed 11
agreement 28
agrees 16
agricultural 4
agriculture 14
ahead 2178
aid 35
aids 13
ailing 4
aim 8
aims 27
air 11
alaska 11
alberta 11
alfalih 5
algeria 20
algerian 5
algiers 8
alliance 8
allies 22
allows 4
alltime 12
almost 39
along 13
also 13
alternative 4
aluminum 46
america 41
american 26
americans 4
americas 15
amid 1050
amidst 9
among 5
amount 4
ample 55
analysis 63
analyst 12
analysts 17
anew 10
angola 6
announce 10
announcement 28
announces 8
annual 15
another 36
anticipation 39
antidumping 8
antiopec 4
anxiety 7
api 618
appeal 16
appears 7
appetite 27
apple 4
approach 5
approaches 18
approval 14
approve 5
approves 15
april 167
arab 8
arabia 154
arabian 5
arabias 10
aramco 76
arctic 17
area 5
areas 4
arent 7
argentina 25
argentine 5
armed 4
army 5
around 40
arrested 6
arrests 7
arrival 5
asia 2404
asian 335
asias 13
ask 6
asks 13
assess 7
assessed 5
asset 12
assets 27
atlantic 8
attack 31
attacks 27
attempt 4
attempts 5
attend 11
attention 26
attract 4
auction 38
auctions 8
aug 6
august 128
aussie 7
austerity 10
australia 23
australian 23
australias 5
auto 12
autumn 5
avengers 6
average 9
aversion 14
avert 5
avoid 31
await 155
awaited 96
awaiting 7
awaits 64
awash 4
away 42
azerbaijan 4
back 405
backfoot 5
backing 8
backs 13
backtoback 5
bad 8
bag 4
bahrain 4
bailout 58
baker 39
bakken 6
balance 38
balanced 4
balancing 4
ban 50
bank 112
bankrupt 5
bankruptcy 10
banks 48
bans 12
bargain 111
bargainbuying 6
bargainhunting 5
bargains 5
barkindo 11
barrel 96
barrels 196
base 6
basin 6
batch 7
battle 25
battles 7
bay 4
bbl 4
bear 22
bearish 240
bears 20
beat 9
beats 15
become 18
becomes 8
beef 15
begin 15
begins 16
behind 16
beige 5
beijing 14
bells 4
belownormal 4
belt 4
benchmark 17
beneficial 5
bernanke 120
bernankes 9
best 38
bet 29
bets 184
better 16
beyond 29
bhp 6
bid 20
bids 13
big 141
bigger 16
biggest 88
bill 30
billion 108
billions 7
bills 6
bin 4
biodiesel 6
biofuel 24
biofuels 11
bird 4
birol 4
bitcoin 5
bite 20
bites 5
black 12
blame 5
blames 4
blast 24
blasts 5
bleak 6
blizzard 8
bln 4
bloated 6
block 14
blockade 5
blockchain 4
blocked 4
blocks 11
bloomberg 13
blow 12
board 12
body 5
boe 13
boj 42
bolster 9
bolsters 15
bond 90
bondbuying 8
book 13
boom 52
booms 5
boost 134
boosted 22
boosting 10
boosts 62
border 8
borrowing 4
boss 6
bottom 42
bounce 180
bounces 151
bouncing 6
bound 8
bp 42
bpd 31
brace 40
braces 20
brazil 171
brazilian 10
brazils 10
break 31
breaking 4
breakout 9
breaks 31
breakthrough 8
breath 4
breather 17
brent 622
brew 4
brews 4
brexit 146
brief 7
briefly 19
brightens 6
bring 9
brings 4
britain 10
british 5
broad 8
broader 6
broadly 25
brushes 8
brussels 4
budget 51
bugs 5
build 297
building 17
builds 45
buildup 9
bulk 6
bull 15
bullion 7
bullish 287
bulls 42
bumpy 4
bunker 21
burst 6
business 26
bust 7
busy 31
buy 63
buyer 6
buyers 37
buying 143
buys 13
cabinet 5
cad 5
caixin 31
california 17
call 42
calls 42
calm 7
camp 5
canada 99
canadas 24
canadian 56
cancels 6
cannot 5
canola 5
cant 12
cap 47
capacity 19
capital 7
capped 28
capping 10
caps 23
captures 4
car 12
carbon 11
cargo 11
cargoes 7
caribbean 5
carlyle 4
carries 5
cars 13
cartel 8
cartels 4
case 35
cash 29
cast 4
casts 9
catalyst 5
category 4
caught 7
cause 11
causes 4
caution 19
cautious 101
cease 5
ceasefire 11
ceiling 25
center 6
central 88
cents 6
ceo 52
ceos 6
certain 4
cftc 6
chad 5
chair 12
chairman 6
challenge 20
challenges 14
chance 16
chances 18
change 46
changed 239
changes 10
chaos 6
charges 4
chart 23
charter 4
charts 7
chatter 7
cheap 15
cheaper 7
check 11
checked 4
cheer 4
chemical 9
chemicals 5
chesapeake 9
chevron 31
chicago 13
chicken 5
chief 49
chile 10
chilly 40
china 1509
chinas 88
chinau.s 11
chinese 235
choppy 87
christmas 9
cite 4
cites 4
citgo 13
citing 7
city 8
claims 173
clarity 7
clash 6
clashes 7
class 4
claws 6
clean 11
cleaner 6
clear 9
clears 4
cliff 85
climate 48
climb 165
climbing 7
climbs 169
clinton 7
close 167
closed 17
closer 22
closes 28
closing 4
closures 4
cloud 7
clouded 4
clues 16
cme 10
cnbc 7
cnpc 7
co2 8
coal 110
coals 4
coast 59
coattails 7
cobalt 6
cocoa 18
coffee 189
coin 4
cold 87
colder 19
collapse 21
collapses 7
colombia 8
come 17
comeback 10
comes 31
comey 6
comic 8
coming 9
comments 208
commerce 9
commercial 10
commit 5
commitment 15
committed 6
committee 6
commodities 165
commodity 32
commods 5
companies 38
company 27
compensate 4
complete 5
completion 4
complex 4
compliance 53
comply 6
compromise 6
concern 34
concerned 6
concerns 912
conditions 24
conference 20
confidence 40
confident 5
confirms 14
conflict 29
conflicting 8
conflicts 5
confusion 4
congress 17
conoco 5
conocophillips 5
consecutive 11
consensus 16
consider 11
considering 5
considers 14
consolidate 12
consolidates 8
constraints 4
construction 9
consumer 66
consumers 7
contagion 4
continue 162
continued 33
continues 213
continuing 14
contract 41
contracts 19
control 18
controversial 5
cool 48
cooler 27
cooling 10
cools 25
cooperate 6
cooperation 34
coordination 4
copper 1212
corn 278
corner 6
corrected 6
correctedpreciousgold 8
correction 10
corrects 5
cost 12
costly 7
costs 26
cotton 133
could 143
council 4
count 221
counter 25
countering 4
counters 6
countries 23
country 16
counts 9
coup 8
course 17
court 21
courts 5
cover 8
covering 18
cpi 54
crack 4
crackdown 6
cracks 6
crash 22
crashes 17
create 7
credit 12
creep 4
creeps 5
crimea 7
crisis 92
critical 11
criticizes 5
crop 238
crops 19
crown 9
crucial 8
crude 6254
crudes 5
crumbles 4
crunch 11
crypto 4
cuba 5
cue 5
cues 34
curacao 5
curb 42
curbs 56
currency 10
current 6
curve 6
cushing 20
cushion 4
customs 10
cut 418
cuts 513
cutting 7
cyprus 42
daily 15
dairy 14
dakota 55
dam 6
damage 8
dampen 4
dampens 15
dash 7
data 3721
date 4
davos 4
day 242
days 34
dead 13
deadline 30
deadlock 7
deadly 5
deal 538
dealing 4
deals 34
death 14
debate 17
debates 4
debt 403
dec 14
decade 18
decades 6
december 159
decent 5
decide 8
decision 191
decisions 6
declares 4
decline 324
declines 118
declining 16
decrease 4
decreased 5
deep 5
deepen 29
deepening 4
deepens 15
deeper 12
deepwater 6
default 36
defends 7
deficit 26
defies 5
delay 20
delayed 30
delays 38
delegates 10
deliver 8
delivers 4
delivery 5
delta 25
deluge 4
demand 977
demands 8
denies 9
dent 10
dents 6
department 12
depends 6
deputy 4
despite 468
details 11
deutsche 5
develop 4
development 11
developments 18
dialogue 5
diamond 5
dies 7
diesel 16
differences 4
digest 40
digests 25
dilemma 5
dim 7
dims 6
dip 233
diplomatic 4
dipping 4
dips 410
direction 58
disappoint 17
disappointing 55
disappointment 9
disappoints 76
disarmament 5
discount 8
discounts 5
discovery 5
discuss 42
discussed 5
discusses 4
dismal 41
dispute 32
disputed 5
disputes 5
disrupt 6
disruption 23
disruptions 22
disrupts 5
distillate 5
ditch 4
dive 16
diverge 6
diversify 4
dives 12
divided 4
dividend 8
dlr 5
document 17
doe 6
doesnt 5
doha 29
dollar 1796
dollars 19
domestic 6
dominance 5
dominate 21
dominates 8
dont 11
dos 4
double 13
doubles 5
doubt 21
doubts 70
dovish 56
dow 8
downbeat 18
downgrade 36
downgrades 6
downplays 6
downside 34
downstream 5
downtrend 10
downturn 8
downward 8
dozens 4
draft 5
drag 16
dragged 5
draghi 61
drags 20
drain 5
drama 12
draw 172
drawdown 35
draws 31
dries 4
drift 17
drifts 35
drill 7
drillers 19
drilling 107
drive 17
driven 6
drivers 4
drives 11
driving 13
drop 561
dropped 4
dropping 7
drops 478
drought 14
drug 4
dry 9
dubai 5
dudley 5
due 39
dump 6
dumped 7
dumping 5
durable 52
duration 5
dutch 6
duties 29
duty 4
dwindling 12
e.u 7
earlier 39
early 491
earnings 33
ease 308
eases 194
easing 165
east 116
eastern 26
easy 21
ebb 5
ebbs 13
ecb 253
eclipse 4
econ 16
economic 235
economies 6
economist 4
economy 117
ecuador 6
edge 625
edges 441
effect 5
effectiveness 4
efficiency 4
effort 10
efforts 20
efsf 4
egypt 30
egyptian 5
egypts 5
eia 222
eight 5
eightmonth 4
election 54
elections 22
electoral 4
electric 14
elevated 4
elusive 4
embargo 7
embrace 5
emerge 10
emergency 17
emerging 19
emissions 13
empire 9
employment 30
empty 6
enbridge 5
end 117
ending 15
ends 151
energy 261
engine 4
england 7
eni 9
enough 14
enters 10
environmental 7
envoy 8
epa 31
equities 72
equity 16
era 5
erase 41
erases 52
erasing 5
escalate 7
escalates 14
escalating 24
esm 5
estimate 9
estimates 166
etf 30
etfs 29
ethanol 12
eu 254
euphoria 5
euro 286
eurogroup 4
europe 90
european 141
europes 6
euros 8
eurozone 15
eve 4
even 56
events 35
ever 12
exceed 4
excess 9
exchange 7
exclusive 238
executive 14
executives 12
exempt 5
exemption 6
exemptions 4
existing 6
exit 25
expand 10
expands 9
expansion 23
expect 15
expectations 151
expected 169
expects 40
expert 6
experts 15
expiration 21
expires 5
expiry 9
explainer 4
exploration 17
explosion 8
export 99
exporter 9
exporters 9
exports 199
exposure 4
extend 291
extended 25
extending 21
extends 356
extension 98
extra 11
extreme 4
exxon 54
exxonmobil 10
exxons 7
eye 132
eyed 436
eyeing 14
eyes 204
ez 21
face 33
faces 36
facilities 6
facility 5
facing 13
factor 4
factors 9
factory 67
fade 35
fades 32
fading 22
fail 16
failed 13
fails 25
failure 8
falih 21
fall 777
falling 104
fallout 13
falls 1147
falter 4
falters 7
familiar 11
fans 4
far 20
farm 43
farmers 55
farms 6
fast 5
faster 7
fate 8
favor 6
favorable 7
fbi 5
fear 26
fears 671
feb 25
february 135
fed 1621
federal 83
feds 19
feed 7
feel 7
fell 37
fester 5
fever 6
fewer 4
fibo 4
field 24
fields 17
fifth 17
fight 27
fighting 16
fights 9
figures 100
files 5
filing 4
fill 6
final 20
finally 6
finance 13
financial 15
financing 8
find 24
finding 6
finds 21
fine 5
finish 5
fire 22
fires 7
firm 105
firmer 20
firming 18
firms 163
first 158
firstquarter 4
fiscal 120
fischer 6
fishing 32
five 31
fiveday 6
fiveweek 9
fiveyear 16
fix 7
fizzle 4
fizzles 7
flags 5
flare 5
flash 26
flat 215
fleet 4
flight 10
flip 4
flirting 4
flirts 10
flock 4
flood 5
floods 6
floor 7
florida 16
flow 4
flows 11
fluctuate 99
fluctuates 44
flurry 8
focus 1224
focused 7
foil 5
follow 6
following 120
follows 5
fomc 114
food 12
foot 13
footing 13
force 11
forced 4
forces 16
forecast 191
forecasts 418
foreign 20
forex 21
forexlive 11
form 5
former 10
forties 7
forum 4
forward 12
found 7
four 23
fourday 5
fourmonth 16
fourth 24
fourweek 6
fouryear 11
fracking 23
fragile 9
framework 6
france 13
frances 4
free 7
freeze 117
freezing 7
freight 6
french 39
fresh 274
fret 5
friday 31
fridays 4
frigid 12
front 4
frozen 6
fruit 5
ft 7
fuel 136
fuels 30
full 6
fully 4
fund 47
fundamentals 15
funding 4
funds 41
future 24
futures 6228
fx 14
g20 30
g7 14
gain 569
gaining 4
gains 2050
game 6
gap 10
gaps 4
gas 2528
gasoline 151
gathering 6
gauge 7
gaza 8
gazprom 6
gc 4
gdp 223
ge 8
gear 4
gears 4
general 6
genscape 4
geopolitical 104
geopolitics 9
german 75
germany 12
get 32
gets 29
getting 8
giant 22
giants 8
give 26
gives 39
glencore 16
global 623
gloom 7
gloomy 12
glut 255
go 23
goal 4
goals 4
goes 16
going 9
gold 7708
goldman 86
golds 13
good 18
goods 56
government 59
governor 7
govt 8
gradual 9
graft 5
grain 397
grains 165
grainscorn 18
grainsus 5
great 8
greater 4
greece 380
greek 192
green 19
greenback 61
grexit 5
grid 5
grind 4
grip 8
grips 4
ground 72
group 35
groups 11
grow 48
growing 60
grows 22
growth 421
guidance 5
guilty 4
guinea 4
gulf 77
half 16
halliburton 6
halt 30
halted 4
halting 5
halts 29
hamper 4
handle 5
hang 4
hard 8
harder 4
harm 5
harvest 30
harvey 61
harveys 6
havens 5
hawkish 33
head 51
headed 10
heading 9
headline 4
headlines 8
heads 50
headwinds 7
health 6
healthcare 6
healthy 5
heat 46
heating 8
heats 8
heatwave 5
heavy 37
hedge 33
hedging 8
heels 4
hefty 10
heightened 6
held 6
help 35
helped 4
helping 4
helps 6
heres 10
high 1654
higher 2031
highest 96
highlights 4
highs 638
hike 373
hikes 34
hints 37
historic 14
history 5
hit 390
hits 416
hitting 42
hog 4
hold 279
holding 22
holdings 12
holds 333
hole 19
holiday 91
holidays 13
holidaythinned 50
home 43
hong 7
hope 19
hopes 552
horizon 4
hot 13
hour 11
hours 60
house 39
housing 89
houston 9
hover 88
hovers 74
hsbc 48
hub 13
huge 17
hughes 38
hundreds 6
hunt 10
hunters 19
hunting 50
hurdles 4
hurricane 44
hurry 4
hurt 17
hurts 6
icahn 7
ice 20
idea 6
ideal 8
ideas 5
iea 193
ifo 5
ignite 4
ignores 18
illegal 6
imf 34
immediate 8
imminent 12
imo 20
impact 48
impasse 24
implemented 4
import 45
important 8
importer 4
importers 5
imports 138
impose 6
imposes 9
impressive 4
improve 8
improved 20
improves 34
improving 20
inaction 5
inch 151
inches 146
including 4
income 7
increase 60
increased 53
increases 22
increasing 10
independence 4
index 19
india 118
indian 21
indias 11
indications 5
indicators 17
indonesia 10
indonesian 4
indonesias 4
industrial 50
industries 5
industry 107
inflation 155
informal 4
infrastructure 7
injection 6
inquiry 4
insurance 4
intact 5
intensifies 9
intensify 13
interest 42
interior 4
international 14
intervention 8
intraday 10
inventories 277
inventory 400
invest 15
investment 45
investments 13
investor 15
investors 557
ipo 22
iran 654
iranian 80
irans 32
iraq 146
iraqi 42
iraqs 16
irene 7
irma 19
iron 21
isaac 17
islamic 11
ism 71
isnt 6
israel 4
issue 9
issues 14
istanbul 5
italian 28
italy 61
italys 5
ivory 7
jackson 18
jan 12
january 156
japan 90
japanese 12
japans 4
jeopardy 4
jet 6
jewellers 4
jewelry 5
jitters 87
job 18
jobless 178
jobs 390
join 16
joining 5
joins 8
joint 17
journal 5
judge 9
juice 8
july 191
jump 153
jumped 7
jumping 6
jumps 234
june 193
kazakhstan 4
keen 6
keep 66
keeping 8
keeps 36
kemp 9
key 113
keystone 44
kick 14
kicks 18
killed 5
killing 6
kills 6
kim 8
kinder 8
king 17
kirkuk 12
knock 4
know 15
kong 7
korea 88
korean 15
koreas 4
kremlin 12
kurdish 11
kurdistan 9
kurds 13
kuwait 30
kuwaiti 4
labor 21
lack 13
lackluster 20
laden 4
lags 4
land 7
lands 4
language 12
languishes 10
large 40
larger 25
largest 33
last 146
lastminute 6
late 24
later 13
lateseason 4
latest 34
latin 7
launch 14
launches 13
law 6
lawmakers 7
lawsuit 4
lead 27
leader 14
leaders 14
leadership 4
leads 7
leak 6
leans 4
lease 8
least 11
leave 17
leaves 19
leaving 7
led 9
left 11
legal 8
legislation 4
lending 7
less 46
letter 4
level 87
levels 58
libya 98
libyan 59
libyas 22
lid 4
life 4
lifeline 4
lifetime 6
lift 37
lifted 12
lifting 5
lifts 35
light 34
like 6
likely 51
limbo 4
limit 56
limited 86
limits 36
line 13
lines 8
linger 68
lingering 13
lingers 12
liquidity 11
list 6
lithium 5
little 261
lng 55
loan 7
loans 7
lobby 8
local 12
lock 13
log 5
london 10
long 30
longer 7
longest 9
longterm 19
look 121
looking 25
looks 93
loom 25
looming 22
looms 61
loose 19
lose 16
losers 4
loses 43
losing 50
loss 103
losses 688
lost 11
louisiana 4
love 5
low 1604
lower 1793
lowers 12
lowest 118
lows 787
ltro 5
lukoil 4
lumber 8
lunar 4
luster 7
mabux 12
macro 5
macron 4
made 7
maduro 21
maintain 24
maintains 14
majeure 4
major 56
majors 27
make 30
makes 28
making 5
malaysia 8
management 7
manager 5
managers 6
manufacturing 63
mar 4
march 190
marches 4
margin 14
marginally 8
margins 18
marine 13
maritime 5
mark 24
market 663
markets 368
massive 54
may 356
mcclendon 4
mean 4
means 5
measure 5
measures 25
meat 18
media 9
meet 72
meeting 454
meetings 29
meets 18
meltdown 7
members 18
memorial 5
mercury 5
merger 4
merkel 6
metal 63
metals 150
metalscopper 44
methane 7
mexican 18
mexico 80
mexicos 17
michael 5
mid2015 6
midday 11
middle 86
middleeast 5
mideast 32
midwest 16
might 5
mil 6
mild 134
milder 16
mildly 31
militant 8
militants 16
military 12
milk 4
million 118
millions 5
mills 9
mine 24
miner 5
minerals 9
miners 29
mines 5
mining 22
minister 167
ministers 23
ministry 22
minutes 240
miss 21
misses 9
missile 29
missiles 6
mississippi 4
mixed 475
mln 26
mn 63
mnuchin 5
mobil 8
mode 8
models 7
moderate 9
moderately 5
moderating 5
modest 63
modestly 47
momentum 27
monday 20
mondays 21
monetary 53
money 15
monitor 29
month 96
monthly 57
months 46
mood 5
moodys 9
morgan 18
morning 13
mostly 62
motiva 7
mount 30
mountain 4
mounting 21
mounts 8
move 201
movers 39
moves 163
moving 13
much 28
mull 13
mulled 8
mulling 5
mulls 25
multimonth 51
multiweek 20
multiyear 31
must 22
muted 11
n 5
nafta 33
names 12
narrow 17
narrowly 11
narrows 10
nat 5
nate 10
natgas 6
national 10
nations 14
native 6
natural 2290
navy 4
near 1103
nearing 6
nearly 94
nears 52
nearterm 12
nebraska 4
need 38
needed 18
needs 9
negative 40
negotiations 11
net 5
netlong 7
neutral 4
new 339
newly 4
news 92
next 97
nfp 12
nickel 8
niger 13
nigeria 49
nigerian 29
nigerias 18
nikkei 5
nine 7
ninemonth 6
nkorea 31
noc 11
nod 4
non 5
nonfarm 34
nonopec 59
nord 5
normal 8
north 134
northeast 13
northern 5
northwest 4
norway 25
norways 4
notch 6
notches 6
note 27
noted 39
notes 7
nov 19
novak 15
november 137
nowhere 4
nuclear 84
nudges 8
nuke 6
numbers 59
nurse 5
nymex 1043
nymexcrude 34
nymexoil 4
obama 36
obamaera 5
obamas 5
ocean 4
oct 19
october 117
odds 15
oecd 4
offer 22
offering 8
offers 26
official 72
officials 26
offline 5
offset 29
offsets 34
offshore 34
oil 9391
oilfield 20
oilfields 7
oilmin 5
oilrich 5
oils 35
oklahoma 4
old 6
oman 6
one 32
oneday 6
onemonth 20
oneweek 13
oneyear 7
ongoing 22
onto 20
opec 1422
opecled 22
opecs 39
open 39
opening 6
opens 19
operation 7
operations 7
opportunities 4
opportunity 6
opposes 6
opposition 9
optimism 159
optimistic 9
options 15
orange 9
order 12
ordered 4
orders 20
ore 22
others 8
ounce 24
outage 12
outages 21
outcome 46
outlook 1641
outlooks 4
outperform 4
outperforms 5
output 956
outside 6
outweigh 11
outweighs 7
overall 9
overbought 5
overcapacity 5
overhang 14
overhaul 6
overnight 90
overshadow 5
overshadows 4
oversold 6
oversupplied 5
oversupply 166
overtake 6
pace 20
package 4
pact 32
paid 4
pain 12
pakistan 9
palladium 35
palm 7
panel 14
panic 5
paper 6
pare 78
pares 96
paring 4
paris 16
parliament 5
pars 4
part 13
partial 7
partner 4
partners 16
party 5
pass 4
passes 13
past 46
pat 6
patch 9
path 18
patient 8
pattern 8
paulson 8
pause 20
pauses 16
paves 5
pay 19
payment 11
payments 5
payroll 7
payrolls 51
pboc 11
pct 110
pdvsa 32
peak 86
peaks 14
pemex 15
pending 8
peninsula 5
people 4
per 30
percent 174
performance 5
permian 14
permit 4
permits 7
perry 9
persist 53
persistent 8
persists 13
personal 5
peru 6
petrobras 16
petroleum 22
petronas 10
philippines 6
phillips 6
philly 14
physical 64
pick 11
picks 9
picture 26
pierces 4
pile 7
pipe 14
pipeline 173
pipelines 10
pivot 5
place 13
places 4
plains 6
plan 94
planned 22
plans 74
plant 25
planting 29
plants 15
platform 5
platinum 15
platts 4
play 18
pledge 27
pledged 5
pledges 18
plot 4
plummet 8
plummets 21
plunge 187
plunges 170
plunging 18
pm 26
pmi 209
pmis 48
point 63
points 59
poised 18
police 8
policies 29
policy 156
political 69
politics 18
poll 39
polls 21
pollution 12
ponder 6
poor 21
pork 8
port 20
portfolio 6
ports 20
portugal 7
position 4
positions 6
positive 80
possibility 6
possible 33
post 62
postbrexit 4
postchristmas 4
postfed 8
postholiday 5
posting 4
posts 85
postusda 4
potential 38
poultry 5
pound 7
powell 25
power 45
powerful 5
powers 7
ppi 12
precious 13
preciousfactors 22
preciousgold 349
precioussilver 22
preciousspot 6
predicts 12
preholiday 5
preliminary 5
premium 11
prepare 8
prepares 10
preparing 7
preps 12
president 23
presidential 15
press 11
presses 4
pressure 193
pressured 11
pressures 9
previous 36
price 299
prices 4462
pricing 11
prince 12
prior 6
private 14
probe 24
probing 4
problem 11
problems 7
process 5
producer 44
producers 100
product 12
production 315
products 29
profit 210
profits 53
profittaking 146
program 22
progress 85
project 36
projections 4
projects 18
prolonged 6
promise 8
promised 4
promises 13
prompts 6
property 5
proposal 17
proposals 4
proposed 11
proposes 15
prospect 13
prospects 119
protect 6
protection 4
protectionism 4
protest 15
protesters 9
protests 15
provide 6
provides 8
province 4
public 10
pull 53
pullback 15
pulls 69
pump 17
pumping 8
pumps 6
purchase 4
purchases 19
purge 6
pursue 5
push 132
pushes 78
pushing 4
put 16
putin 40
puts 16
q1 17
q2 10
q3 9
q4 11
qatar 34
qe 13
qe3 11
quake 5
quality 6
quantitative 5
quarter 38
quarterly 14
quashes 4
quest 7
question 14
questions 6
quick 8
quiet 32
quits 4
quota 13
quotas 10
quoted 13
race 13
races 9
rail 15
railroads 4
rain 14
rainfall 9
rains 9
raise 38
raises 27
raising 9
rallies 250
rally 779
rallying 22
ramp 10
range 57
rangebound 55
rapid 4
rare 9
rate 436
ratehike 5
rates 72
rating 7
ratings 7
rattle 4
rattles 4
rba 5
reach 43
reached 12
reaches 30
reaching 8
react 10
readies 7
reading 5
ready 27
real 6
reality 4
really 6
reapproach 29
reapproaches 33
reason 4
reassess 5
reassures 4
rebalance 10
rebalancing 25
rebel 4
rebels 8
rebound 285
rebounds 280
recede 9
receding 4
recent 33
recession 17
reclaim 6
record 300
recordhigh 4
records 6
recover 57
recovering 10
recovers 53
recovery 81
red 19
reduce 13
reduced 24
referendum 13
refined 10
refiner 16
refineries 38
refiners 53
refinery 66
refining 27
reform 25
reforms 9
regain 30
regains 52
region 8
regional 22
regions 4
regulation 8
regulations 6
regulator 12
regulatory 5
reignites 5
reigns 6
reiterates 5
reject 7
rejection 4
rejects 8
relations 7
relatively 23
release 40
releases 4
relief 16
remain 305
remains 256
remarks 62
renewable 11
renewables 7
renewed 50
reopen 12
replace 5
report 937
reported 6
reportedly 15
reports 168
republican 6
request 7
rescue 6
reserve 96
reserves 29
resilient 4
resist 4
resistance 20
resolution 11
resolve 4
response 14
restart 26
restarts 4
restrictions 7
results 26
resume 35
resumes 43
resurface 8
retail 127
retain 4
retaliation 5
retest 4
retrace 5
retraces 5
retreat 82
retreats 87
return 42
returning 4
returns 33
reuters 52
reveal 6
reveals 13
revenue 12
revenues 5
reversal 10
reverse 29
reverses 35
review 126
reviews 5
revision 9
revival 11
revive 8
revives 6
revolution 6
ria 9
rice 4
ride 11
rieber 4
rift 7
rig 248
right 14
rigs 48
rise 730
rises 657
rising 240
risk 157
riskier 9
riskoff 44
riskon 24
risks 67
rival 11
rivals 13
river 7
road 8
robust 42
rock 6
rocked 8
rockets 13
roil 5
roils 4
role 10
rose 28
rosneft 17
ross 8
rouhani 7
round 6
rout 42
route 5
routes 4
row 25
rsi 9
rule 21
rules 35
ruling 21
rumors 12
run 18
running 6
runs 9
rusal 9
rush 17
russia 241
russian 109
russias 40
russiasaudi 5
russiaukraine 5
sabic 4
sachs 40
safe 49
safehaven 63
safety 30
sag 5
said 23
sale 39
sales 208
sanction 13
sanctions 242
sand 6
sands 12
sandy 14
santos 5
saudi 529
saudiiran 8
saudirussia 6
saudirussian 8
saudis 95
save 10
say 46
says 520
scale 9
scandal 7
scare 4
scheme 9
scientists 5
scope 4
scramble 5
scrap 5
scrutiny 5
sea 37
search 10
season 7
seasonal 5
second 92
secret 5
secretary 17
sector 46
security 20
see 58
seek 35
seeking 8
seeks 44
seen 194
sees 146
seesaw 13
seesaws 9
seize 5
seizes 4
sell 40
selling 46
selloff 101
sells 8
senate 13
senators 9
send 17
sending 5
sends 25
sense 4
sent 6
sentiment 148
sentiments 9
sept 25
september 122
series 5
service 18
services 19
servicesector 7
session 315
sessions 9
set 193
sets 30
setting 4
settle 336
settled 14
settlement 11
settles 122
seven 9
seventh 9
sevenyear 5
several 4
shadow 6
shake 7
shaky 11
shale 185
shana 5
shanghai 14
share 22
shares 17
sharp 105
sharper 4
sharply 202
sheds 4
shell 43
shells 5
shift 15
shifting 8
shifts 79
shine 5
ship 17
shipment 5
shipments 22
shipping 31
ships 14
shock 12
shoot 18
shoots 48
short 45
shortage 14
shortages 5
shortcovering 11
shortlived 7
shortterm 6
shot 4
show 77
showdown 8
showing 11
shows 139
shrinking 7
shrinks 5
shrug 22
shrugged 11
shrugging 4
shrugs 53
shun 4
shut 48
shutdown 54
shuts 8
sidestep 6
sideways 11
sight 20
sights 5
sign 18
signal 23
signals 64
significant 5
signs 74
silver 684
since 294
singapore 12
sink 67
sinks 89
sinopec 11
sinou.s 12
site 5
situation 4
six 19
sixday 5
sixmonth 12
sixth 10
sixthstraight 4
sixweek 7
sixyear 12
sizable 6
size 5
skepticism 6
skid 16
skyrockets 4
slack 10
slammed 5
slams 7
slaps 11
slash 13
slashes 15
slide 170
slides 176
sliding 9
slight 26
slightly 316
slip 187
slips 237
slovak 4
slovakia 6
slow 27
slowdown 70
slower 9
slowing 34
slows 25
sluggish 10
slump 196
slumping 7
slumps 130
sma 9
small 31
smaller 9
smallerthanexpected 9
smartly 7
smog 9
snag 6
snap 61
snapping 7
snaps 19
snow 5
soar 59
soaring 14
soars 121
soft 316
soften 6
softens 26
softer 51
softs 132
softsarabica 9
softscocoa 16
solar 16
solid 91
solidly 5
soon 21
sorghum 9
soros 5
sour 7
source 39
sources 171
south 79
southeast 4
southern 9
sovereign 7
soy 60
soybean 75
soybeans 193
spain 104
spanish 55
spark 26
sparks 45
spat 14
spdr 5
speak 4
speakers 42
speaks 6
special 15
speculation 75
speculative 6
speculators 8
speech 54
speeches 6
speed 5
spend 5
spending 40
spike 52
spikes 41
spill 19
spite 13
split 8
spooked 4
spooks 5
spot 13
spotlight 14
spread 35
spreads 8
spree 5
spring 24
springtime 4
spur 10
spurs 15
squarely 5
squeeze 9
squeezed 6
st 7
stability 10
stabilization 4
stabilize 26
stabilizes 9
stable 23
staff 4
stage 16
stages 13
stake 22
stalemate 8
stall 10
stalled 8
stalls 20
stance 22
stand 5
standards 4
standoff 11
stands 9
stanley 11
star 5
start 117
starting 6
starts 59
state 57
statement 52
statements 10
stateowned 5
states 27
statoil 5
status 4
stay 48
stays 105
steadies 86
steadily 4
steady 536
steam 15
steel 114
steelmakers 4
steep 4
stem 4
stemming 27
step 12
steps 18
sterling 9
stick 10
sticks 9
still 154
stimulus 258
stirs 4
stock 115
stockpile 190
stockpiles 140
stocks 515
stoke 10
stokes 5
stop 16
stopped 5
stops 4
storage 321
storm 102
storms 11
straight 100
stranded 4
strategic 11
strategy 18
streak 80
stream 5
street 33
strength 108
strengthen 5
strengthening 6
strengthens 52
stress 4
strife 6
strike 51
strikes 24
striking 4
string 4
strong 276
stronger 246
strongest 11
strongly 8
struggle 73
struggles 101
struggling 6
stuck 19
study 9
stumble 5
stumbles 8
subdued 37
subsidies 7
subsidized 4
success 4
sues 7
suffer 4
suffers 8
sugar 258
suggest 4
suggests 9
sulfur 10
summer 25
summers 5
summit 84
suncor 4
supplied 5
supplier 6
supplies 275
supply 2006
supplydemand 5
support 255
supported 89
supportive 5
supports 122
supreme 4
surge 180
surges 202
surging 35
surplus 30
surprise 108
surprises 6
surprising 16
survey 59
survival 4
suspends 9
sustainable 4
sustained 11
swap 8
sway 8
sweeps 5
swell 6
swelling 7
swing 16
swings 25
swiss 10
switch 4
switches 4
syria 112
syrian 7
system 10
tackle 8
tad 12
take 87
takeover 4
takers 15
takes 71
taking 188
talk 157
talking 6
talks 364
tank 7
tanker 26
tankers 20
tanks 11
tap 34
taper 64
tapering 41
taps 11
target 23
targeted 4
targets 27
tariff 50
tariffs 102
tass 6
tax 61
taxes 9
tds 7
team 5
teapot 6
tech 4
technical 111
technicals 7
technology 9
tells 18
temperatures 57
tempers 8
temps 18
tender 4
tense 4
tension 72
tensions 255
tepid 5
term 4
terminal 8
terminals 4
terms 5
territory 30
test 43
testimony 42
tests 17
texas 43
thai 4
thanksgiving 9
thawing 8
theft 4
theres 4
thin 69
things 12
think 8
third 58
thirst 4
though 25
thousands 4
threat 42
threaten 13
threatened 4
threatens 46
threats 21
three 44
threeday 6
threemonth 25
threeweek 18
threeyear 12
throughput 4
throws 5
thursday 15
thursdays 5
tick 27
ticks 100
ties 18
tight 41
tighten 14
tightening 32
tightens 12
tighter 23
time 106
times 8
timing 21
today 16
told 4
toll 9
tone 23
tons 5
top 124
tops 52
total 26
touch 12
touches 11
tough 10
tougher 6
tour 5
touts 6
toward 60
towards 68
town 5
towns 6
track 74
tracking 17
tracks 8
trade 1685
trader 7
traders 222
trades 318
tradetalk 4
tradewar 9
trading 180
trafigura 5
train 5
trans 4
transcanada 19
transcript 6
transition 5
transparency 7
transport 6
trapped 4
travel 11
tread 9
treads 10
treasury 17
trend 46
trends 9
tribal 4
tribes 7
trickle 4
trickles 6
trigger 5
triggers 12
trillion 4
trim 101
trims 84
trip 7
tripoli 5
tropical 30
trouble 7
troubled 4
trough 12
truce 8
truck 4
trudeau 7
trump 420
trumps 65
trumpxi 10
trust 6
try 8
trying 10
tuesday 18
tuesdays 8
tumble 186
tumbles 168
tumbling 7
turbulence 4
turbulent 4
turkey 30
turkeys 5
turkish 9
turmoil 53
turn 242
turning 14
turns 239
tv 7
tweet 12
tweets 13
two 53
twoday 11
twomonth 11
twoweek 28
twoyear 15
u.k 14
u.n 12
u.s 6936
u.s.china 81
u.s.iran 7
u.s.north 6
uae 23
ubs 5
uk 20
ukraine 189
ukrainerussia 5
un 4
unable 4
uncertain 22
uncertainties 7
uncertainty 177
unchanged 33
unclear 5
undermines 4
underpins 5
underway 12
unease 20
unemployment 5
unexpected 29
unexpectedly 19
unfair 4
union 8
unipec 5
unit 9
united 16
unlikely 32
unlock 5
unrest 30
unveils 5
upbeat 243
upcoming 5
update 200
upgrade 6
ups 7
upside 54
uptick 11
uptrend 10
upward 6
urge 8
urged 4
urges 29
us 429
uschina 18
usd 60
usd100 19
usd2.00 6
usd80 7
usd97 6
usd99 7
usda 143
use 20
used 5
using 5
utility 4
uturn 4
vale 7
value 5
vanishes 4
vehicle 4
vehicles 5
venezuela 165
venezuelan 31
venezuelas 38
venture 6
ventures 7
verge 5
vessels 5
veterans 6
via 7
victory 10
vienna 18
vietnam 6
view 25
views 148
violence 35
visit 13
volatile 49
volatility 29
volume 5
volumes 9
vote 132
voters 4
votes 7
vow 8
vows 15
vs 50
vulnerable 8
wage 5
wages 5
wait 24
waiting 11
waits 6
waiver 15
waivers 23
wake 23
wall 42
wallows 6
wane 17
wanes 26
waning 32
want 6
wanted 4
wants 33
war 128
warm 121
warmer 39
warming 28
warn 9
warning 26
warnings 8
warns 57
wars 6
wary 13
washington 12
wastewater 4
watch 41
watched 8
watching 5
water 32
waters 6
wave 29
waver 15
wavers 20
way 21
ways 12
weak 405
weaken 14
weakening 7
weakens 101
weaker 445
weakest 4
weakness 74
weapon 4
weapons 9
weather 690
wednesday 15
wednesdays 9
week 460
weekend 20
weekly 1628
weeks 76
weigh 323
weighed 17
weighs 279
welcomes 6
well 22
wells 15
west 20
western 10
wgc 5
whatever 4
whats 9
wheat 247
white 31
widens 11
widespread 4
wild 4
wildfire 12
willing 5
win 32
wind 9
winds 4
winner 4
winners 7
winning 23
wins 17
winter 65
wintry 6
withdrawal 26
withdraws 4
within 21
without 16
wobble 6
wobbles 5
woes 221
wont 30
woos 5
words 12
work 25
workers 18
working 12
world 56
worlds 21
worldwide 4
worries 327
worry 45
worse 4
worsen 9
worsens 6
worst 30
worth 6
would 27
wrap 11
wsj 17
wti 543
wtibrent 14
wto 31
xi 5
xl 21
year 177
yearend 15
yearly 10
years 92
yellen 144
yellens 17
yellow 5
yemen 31
yen 10
yet 25
yield 16
yields 63
york 13
ytd 6
yuan 15
zealand 7
zero 6
zew 7
zone 185
